app/controllers/line_items_controller.rb

  def create

    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)


    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Tue, 06 Aug 2013 19:21:18 UTC +00:00], ["updated_at", Tue, 06 Aug 2013 19:21:18 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cart_id", 7], ["created_at", Mon, 19 Aug 2013 02:02:12 UTC +00:00], ["product_id", 1], ["quantity", 1], ["updated_at", Mon, 19 Aug 2013 02:02:12 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2013-08-19 16:46:37.828591' WHERE "line_items"."id" = 1